{
    "A simple web component for translating text content in HTML pages.": {
        "de": "Eine einfache Webkomponente zum Übersetzen von Textinhalten in HTML-Seiten.",
        "fi": "Yksinkertainen web-komponentti HTML-sivujen tekstisisällön kääntämiseen.",
        "sv": "En enkel webbkomponent för att översätta textinnehåll på HTML-sidor."
    },
    "Author your HTML content in any language. Mark the translatable sections with the lang attribute. Create a JSON file for translations. Add the web component to your page, and it will render a language switcher element for the languages found.": {
        "de": "Erstellen Sie Ihre HTML-Inhalte in jeder Sprache. Markieren Sie die übersetzbaren Abschnitte mit dem Attribut 'lang'. Erstellen Sie eine JSON-Datei für Übersetzungen. Fügen Sie die Webkomponente zu Ihrer Seite hinzu, und sie rendert ein Sprachelement für die gefundenen Sprachen.",
        "fi": "Luo HTML-sisältösi millä tahansa kielellä. Merkitse käännettävät osiot lang-attribuutilla. Luo JSON-tiedosto käännöksiä varten. Lisää web-komponentti sivullesi, ja se muodostaa kielenvaihtajan löydetyille kielille.",
        "sv": "Skapa ditt HTML-innehåll på vilket språk som helst. Markera de översättbara avsnitten med lang-attributet. Skapa en JSON-fil för översättningar. Lägg till webbkomponenten på din sida, och den kommer att rendera ett språkväljarelement för de språk som hittats."
    },
    "Features": {
        "de": "Funktionen",
        "fi": "Ominaisuudet",
        "sv": "Funktioner"
    },
    "Apply CSS styles like you would to a ul/li list": {
        "de": "Wenden Sie CSS-Stile an, wie Sie es bei einer <code>ul</code>/<code>li</code>-Liste tun würden",
        "fi": "Käytä CSS-tyylejä kuten <code>ul</code>/<code>li</code>-listalle",
        "sv": "Använd CSS-stilar som du skulle göra för en <code>ul</code>/<code>li</code>-lista"
    },
    "Automatic language detection from URL parameters (?lang=en)": {
        "de": "Automatische Spracherkennung aus URL-Parametern (<code>?lang=de</code>)",
        "fi": "Automaattinen kielen tunnistus URL-parametreista (<code>?lang=fi</code>)",
        "sv": "Automatisk språkdetection från URL-parametrar (<code>?lang=sv</code>)"
    },
    "Dynamic content translation (new elements added to DOM)": {
        "de": "Dynamische Inhaltsübersetzung (neue Elemente, die dem DOM hinzugefügt werden)",
        "fi": "Dynaaminen sisällön käännös (uudet elementit lisätään DOM:iin)",
        "sv": "Dynamisk innehållsöversättning (nya element som läggs till i DOM)"
    },
    "Fallback to default language if translation not found": {
        "de": "Fallback zur Standardsprache, wenn keine Übersetzung gefunden wird",
        "fi": "Paluu oletuskieleen, jos käännöstä ei löydy",
        "sv": "Återgång till standardspråk om översättning inte hittas"
    },
    "Support for nested translatable elements": {
        "de": "Unterstützung für verschachtelte übersetzbare Elemente",
        "fi": "Tuki sisäkkäisille käännettäville elementeille",
        "sv": "Stöd för inbäddade översättbara element"
    },
    "Attribute translation": {
        "de": "Attributübersetzung",
        "fi": "Attribuuttien käännös",
        "sv": "Attributöversättning"
    },
    "Usage": {
        "de": "Verwendung",
        "fi": "Käyttö",
        "sv": "Användning"
    },
    "Basic Setup": {
        "de":"Verwendung",
        "fi": "Perusasetukset",
        "sv": "Grundläggande inställningar"
    },
    "1. Include the JavaScript code in your HTML:": {
        "de": "1. Binden Sie den JavaScript-Code in Ihr HTML ein:",
        "fi": "1. Sisällytä JavaScript-koodi HTML-tiedostoosi:",
        "sv": "1. Inkludera JavaScript-koden i din HTML:"
    },
    "2. Add the translate element to your page:": {
        "de": "2. Fügen Sie das Übersetzungselement zu Ihrer Seite hinzu:",
        "fi": "2. Lisää käännöselementti sivullesi:",
        "sv": "2. Lägg till översättningselementet på din sida:"
    },
    "3. Optionally, style the language switcher element using CSS:": {
        "de": "3. Optional: Stylen Sie das Sprachelement mit CSS:",
        "fi": "3. Halutessasi muotoile kielivalikko CSS:llä:",
        "sv": "3. Valfritt, styla språkväljarelementet med CSS:"
    },
    "You can use translate-element.css as an example.": {
        "de": "Sie können <a href=\"https://unpkg.com/translate-element/translate-element.css\">translate-element.css</a> als Beispiel verwenden.",
        "fi": "Voit käyttää tiedostoa <a href=\"https://unpkg.com/translate-element/translate-element.css\">translate-element.css</a> esimerkkinä.",
        "sv": "Du kan använda <a href=\"https://unpkg.com/translate-element/translate-element.css\">translate-element.css</a> som ett exempel."
    },
    "Creating Translatable Content": {
        "de": "Erstellen von übersetzbarem Inhalt",
        "fi": "Käännettävän sisällön luominen",
        "sv": "Skapa översättbart innehåll"
    },
    "Mark elements for translation by adding the lang attribute with your default language:": {
        "de": "Markieren Sie Elemente zur Übersetzung, indem Sie das Attribut 'lang' mit Ihrer Standardsprache hinzufügen:",
        "fi": "Merkitse elementit käännettäviksi lisäämällä lang-attribuutti oletuskielelläsi:",
        "sv": "Markera element för översättning genom att lägga till attributet 'lang' med ditt standardspråk:"
    },
    "Text Content": {
        "de": "Textinhalt",
        "fi": "Tekstisisältö",
        "sv": "Textinnehåll"
    },
    "Form Elements": {
        "de": "Formularelemente",
        "fi": "Lomake-elementit",
        "sv": "Formulärelement"
    },
    "Attributes": {
        "de": "Attribute",
        "fi": "Attribuutit",
        "sv": "Attribut"
    },
    "If an element has the lang attribute, the following attributes are translated: alt, cite, href, label, placeholder, src, srcset, title, value.": {
        "de": "Wenn ein Element das Attribut <code>lang</code> hat, werden die folgenden Attribute übersetzt: <code>alt</code>, <code>cite</code>, <code>href</code>, <code>label</code>, <code>placeholder</code>, <code>src</code>, <code>srcset</code>, <code>title</code>, <code>value</code>.",
        "fi": "Jos elementillä on <code>lang</code>-attribuutti, seuraavat attribuutit käännetään: <code>alt</code>, <code>cite</code>, <code>href</code>, <code>label</code>, <code>placeholder</code>, <code>src</code>, <code>srcset</code>, <code>title</code>, <code>value</code>.",
        "sv": "Om ett element har attributet <code>lang</code> översätts följande attribut: <code>alt</code>, <code>cite</code>, <code>href</code>, <code>label</code>, <code>placeholder</code>, <code>src</code>, <code>srcset</code>, <code>title</code>, <code>value</code>."
    },
    "Embedded translations": {
        "de": "Eingebettete Übersetzungen",
        "fi": "Upotetut käännökset",
        "sv": "Inbäddade översättningar"
    },
    "You can maintain the translations directly within your HTML:": {
        "de": "Sie können die Übersetzungen direkt in Ihrem HTML pflegen:",
        "fi": "Voit ylläpitää käännöksiä suoraan HTML:ssä:",
        "sv": "Du kan underhålla översättningarna direkt i din HTML:"
    },
    "Translation File (translations.json)": {
        "de": "Übersetzungsdatei (translations.json)",
        "fi": "Käännöstiedosto (translations.json)",
        "sv": "Översättningsfil (translations.json)"
    },
    "Create a JSON file with your translations. First level keys are the textContent of the elements to translate. The values are objects with a language codes as keys and corresponding translations as values. Example:": {
        "de": "Erstellen Sie eine JSON-Datei mit Ihren Übersetzungen. Die Schlüssel der ersten Ebene sind der <code>textContent</code> der zu übersetzenden Elemente. Die Werte sind Objekte mit Sprachcodes als Schlüssel und den entsprechenden Übersetzungen als Werte. Beispiel:",
        "fi": "Luo JSON-tiedosto käännöksilläsi. Ensimmäisen tason avaimet ovat käännettävien elementtien <code>textContent</code>. Arvot ovat objekteja, joissa kielikoodit ovat avaimina ja vastaavat käännökset arvoina. Esimerkki:",
        "sv": "Skapa en JSON-fil med dina översättningar. Första nivåns nycklar är <code>textContent</code> för de element som ska översättas. Värdena är objekt med språkkoder som nycklar och motsvarande översättningar som värden. Exempel:"
    },
    "Refer to the translation file in your HTML:": {
        "de": "Verweisen Sie in Ihrem HTML auf die Übersetzungsdatei:",
        "fi": "Viittaa käännöstiedostoon HTML:ssäsi:",
        "sv": "Referera till översättningsfilen i din HTML:"
    },
    "Console output": {
        "de": "Konsolenausgabe",
        "fi": "Konsolin tuloste",
        "sv": "Konsolutdata"
    },
    "If the HTML content contains an element with the lang attribute, but no translations are found in the translations.json file, the web component will output the textContent of the untranslated element into the developer console.": {
        "de": "Wenn der HTML-Inhalt ein Element mit dem Attribut <code>lang</code> enthält, aber keine Übersetzungen in der Datei <code>translations.json</code> gefunden werden, gibt die Webkomponente den <code>textContent</code> des nicht übersetzten Elements in der Entwicklertools-Konsole aus.",
        "fi": "Jos HTML-sisältö sisältää elementin, jossa on <code>lang</code>-attribuutti, mutta käännöksiä ei löydy tiedostosta <code>translations.json</code>, komponentti tulostaa käännetyn elementin <code>textContent</code>-sisällön kehittäjäkonsoliin.",
        "sv": "Om HTML-innehållet innehåller ett element med attributet <code>lang</code>, men inga översättningar hittas i filen <code>translations.json</code>, kommer webbkomponenten att skriva ut <code>textContent</code> för det oöversatta elementet i utvecklarkonsolen."
    },
    "Complete Example": {
        "de": "Vollständiges Beispiel",
        "fi": "Kokonainen esimerkki",
        "sv": "Komplett exempel"
    }
}
